{"id":"6287a05d-ab51-4868-8b93-c70d5de397fe","date":"2023-01-21T03:03:36.968Z","applicants_name":"Nathaniel Otis","email":"otisnt@beloit.edu","professional_background":"I am a student at Beloit College. \nAs a Server and Healthcare Assistant at Presbyterian Homes & Services, I was responsible for providing excellent customer service, assisting residents with their daily needs, and maintaining a clean and safe environment. My duties included serving meals, assisting with activities of daily living, and providing general assistance to residents. I have a strong understanding of infection control and food safety regulations and ensured that all food was prepared and served in compliance with health department standards. I was able to multitask and work efficiently in a team environment, which helped to improve the overall experience of the residents.\nAs a Sales Associate at Plato's Closet, I was responsible for providing excellent customer service, assisting customers with their purchases, and maintaining a visually appealing store display. My duties included assisting customers with their purchases, processing transactions, managing inventory, and keeping the store organized. I have a strong understanding of fashion trends and was able to assist customers in finding the perfect outfit. I was able to multitask and work efficiently in a fast-paced environment, which helped to improve the overall customer experience.\nAs a Food Service Worker at the MN Statefair, I was responsible for a variety of tasks in a fast-paced environment. My duties included food preparation, grill cooking, cashiering, scone preparation, and assisting the baristas. I have a strong understanding of food safety regulations and ensured that all food was prepared in compliance with health department standards. I was able to multitask and work efficiently in a team environment, which helped to improve the overall customer experience.\nAs a Construction Crew Assistant at Urban Rebuilders, I was responsible for assisting the crew in various tasks during the construction process of residential Projects. My duties included helping with site preparation, materials handling, and assisting skilled tradesmen such as carpenters and electricians. I was able to multitask and work efficiently in a team environment, which helped to improve the overall efficiency of the construction projects.","job_title":"Server","job_post":"EVERY DAY, YOU WILL\nTake customers’ food and beverage orders\nAssist with setting tables and rearranging tables to accommodate parties\nMaintain cleanliness standards in restaurant, wait-station and kitchen service area in order to have a clean, presentable and attractive facility and to satisfy state and local health board requirements\nReceive proper payment from guest and ensures accuracy of guest check and method of payment in order to safeguard customer and company\nRespond to customer inquiries and comments in person and on phone by providing timely and knowledgeable information in order to provide quality customer service\nPresent a clean and professional appearance at all times\nHave fun at work; leave baggage at the door; come to work with a positive attitude ready and willing to help create a fun and memorable experience for our guests\nRequirements\n\nYOU WILL BE GREAT AT TRUK'T IF\nYou are at least 18 years of age\nYou have basic math skills (able to add, subtract, and count change back to customer)\nYou have legible handwriting, strong customer service and verbal communication skills\nYOU ARE A VARSITY PLAYER IF\nYou have one year server experience\nMICROS and Square POS Systems","response":" experience\nYou have a passion for the hospitality industry\n\nDear Hiring Manager,\n\nI am writing to apply for the position of Server at Truk't as advertised on your website. With my experience in customer service, food preparation and service, and my excellent interpersonal communication skills, I am confident that I am the right fit for this role.\n\nI have been working in the hospitality industry for the past three years in various positions. As a Server and Healthcare Assistant at Presbyterian Homes & Services, I was responsible for providing excellent customer service, assisting residents with their daily needs, and maintaining a clean and safe environment. I have a strong understanding of infection control and food safety regulations and ensured that all food was prepared and served in compliance with health department standards. I was able to multitask and work efficiently in a team environment, which helped to improve the overall experience of the residents. As a Sales Associate at Plato's Closet, I was responsible for providing excellent customer service, assisting customers with their purchases, and maintaining a visually appealing store display. I have a strong understanding of fashion trends and was able to assist customers in finding the perfect outfit. As a Food Service Worker at the MN Statefair, I was responsible for a variety of tasks in a fast-paced environment. My duties included food preparation, grill cooking, cashiering, scone preparation, and assisting the baristas. I have a strong understanding of food safety regulations and ensured that all food was prepared in compliance with health department standards.\n\nI am confident that my experience, skills, and knowledge make me an ideal candidate for this position. I have a passion for the hospitality industry and have the ability to multitask and work efficiently in a team environment. I am committed to providing quality customer service, and I am confident that I can help create a fun and memorable experience for Truk't guests.\n\nThank you for your time and consideration. I look forward to hearing from you.\n\nSincerely, \n[Your Name]"}
{"id":"f2e529ef-ad5a-4ca4-9f39-bb4faf51ecee","date":"2023-01-21T15:41:15.569Z","applicants_name":"Nathaniel Otis","email":"otisnt@beloit.edu","professional_background":"I am a student at Beloit College. \nAs a Server and Healthcare Assistant at Presbyterian Homes & Services, I was responsible for providing excellent customer service, assisting residents with their daily needs, and maintaining a clean and safe environment. My duties included serving meals, assisting with activities of daily living, and providing general assistance to residents. I have a strong understanding of infection control and food safety regulations and ensured that all food was prepared and served in compliance with health department standards. I was able to multitask and work efficiently in a team environment, which helped to improve the overall experience of the residents.\nAs a Sales Associate at Plato's Closet, I was responsible for providing excellent customer service, assisting customers with their purchases, and maintaining a visually appealing store display. My duties included assisting customers with their purchases, processing transactions, managing inventory, and keeping the store organized. I have a strong understanding of fashion trends and was able to assist customers in finding the perfect outfit. I was able to multitask and work efficiently in a fast-paced environment, which helped to improve the overall customer experience.\nAs a Food Service Worker at the MN Statefair, I was responsible for a variety of tasks in a fast-paced environment. My duties included food preparation, grill cooking, cashiering, scone preparation, and assisting the baristas. I have a strong understanding of food safety regulations and ensured that all food was prepared in compliance with health department standards. I was able to multitask and work efficiently in a team environment, which helped to improve the overall customer experience.\nAs a Construction Crew Assistant at Urban Rebuilders, I was responsible for assisting the crew in various tasks during the construction process of residential Projects. My duties included helping with site preparation, materials handling, and assisting skilled tradesmen such as carpenters and electricians. I was able to multitask and work efficiently in a team environment, which helped to improve the overall efficiency of the construction projects.","job_title":"Server","job_post":"EVERY DAY, YOU WILL\nTake customers’ food and beverage orders\nAssist with setting tables and rearranging tables to accommodate parties\nMaintain cleanliness standards in restaurant, wait-station and kitchen service area in order to have a clean, presentable and attractive facility and to satisfy state and local health board requirements\nReceive proper payment from guest and ensures accuracy of guest check and method of payment in order to safeguard customer and company\nRespond to customer inquiries and comments in person and on phone by providing timely and knowledgeable information in order to provide quality customer service\nPresent a clean and professional appearance at all times\nHave fun at work; leave baggage at the door; come to work with a positive attitude ready and willing to help create a fun and memorable experience for our guests\nRequirements\nYOU WILL BE GREAT AT TRUK'T IF\nYou are at least 18 years of age\nYou have basic math skills (able to add, subtract, and count change back to customer)\nYou have legible handwriting, strong customer service and verbal communication skills\nYOU ARE A VARSITY PLAYER IF\nYou have one year server experience\nMICROS and Square POS Systems","response":"\n\nDear Hiring Manager, \n\nI am writing to apply for the position of Server at Truk't. Based on the job description, I am confident that my experience in customer service and hospitality, coupled with my strong work ethic, make me a great fit for this role. \n\nI have extensive experience in customer service, food service, and hospitality. As a Server and Healthcare Assistant at Presbyterian Homes & Services, I was responsible for providing excellent customer service, assisting residents with their daily needs, and maintaining a clean and safe environment. I have a strong understanding of infection control and food safety regulations and ensured that all food was prepared and served in compliance with health department standards. My experience at Plato's Closet as a Sales Associate also helped me to develop my customer service skills and understand the importance of providing excellent customer service. I have a strong understanding of fashion trends and was able to assist customers in finding the perfect outfit. Additionally, my experience as a Food Service Worker at the MN Statefair and as a Construction Crew Assistant at Urban Rebuilders has given me the ability to multitask and work efficiently in a team environment. \n\nI understand the importance of providing excellent customer service and ensuring that all tasks are completed in a timely and efficient manner. I am confident that I can be an asset to your team and help to create a fun and memorable experience for your guests. I am excited to learn more about this opportunity and I look forward to hearing from you. \n\nSincerely, \nYour Name"}
{"id":"0a887b42-e448-49f8-964b-8534a0789c16","date":"2023-01-21T17:29:45.496Z","applicants_name":"Julio Manyari","email":"jmanyariv@gmail.com","professional_background":"Strategic and goal-driven professional with demonstrated experience in leading financial risk teams to develop sound risk frameworks. Skilled in designing credit and market risk models to quantify the expected loss of investments. Passionate about aiding organizations in leveraging risk management tools to achieve objectives.\n\nCore Competences: Strategic Thinking , Risk Assessment , Detail Oriented, Cross-functional projects, Team Player, Financial Services      , Interpersonal Skills, Analytical Skills\n  \nTeaching Associate, Columbia University – New York, USA                                      May 2021 – Aug 2021\n•\tSupporting lecturer in the delivery of operational risk management class, weekly discussions, and assignment grading.\nCareer Design Lab (CLD) Intern, Columbia University – New York, USA                   Oct 2020 – Apr 2021\n•\tServed as a CDL ambassador between students and industry to coordinate events, gather stakeholder requirements and strategize initiatives.\nLa Positiva Seguros - Lima, Peru                                                                               Oct 2010 – Dec 2019                                                           \nSenior Risk Manager of Investments and Surety                                                     May 2019 – Dec 2019                                                           \n•\tAdapted the investment risk management for the company and its subsidiaries to meet international standards of Fosun Group (China), the company’s new main shareholder; aided to comply with regulatory frameworks such as Solvency II and IFRS 9\n•\tHired two senior analysts to form a new department of credit risk of surety and reinsurance business\n•\tDeveloped a risk management framework to evaluate the credit risk of new proposals of company contracts and monitored the risk of the surety portfolio of $1B \n•\tLed a team of 6 risk senior analysts including overseeing their performance; promoted several times \nInvestment Risk Manager                                                                                         May 2014 – May 2019                                                           \n•\tDesigned a robust investment risk model for portfolios over $1B; prevented downgrades and significant financial losses. Maintained a default ratio of less than 0.5% of the portfolio\n•\tIntroduced new proposals to the company’s Risk Committee and at Board meetings, resulting in the implementation of new hedging strategies, which were aligned with the Board's risk appetite and allowed company to meet internal objectives and regulatory indicators\n•\tLed a team of 4 risk analysts and oversaw development of risk models for new types of investments; defined internal limits and established an early alerts system to prevent high concentration in investments\nInvestment Risk Analyst                                                                                           May 2012 – May 2014                                                           \n•\tPerformed counterparty risk analysis of fixed income and equities investments of up to $ 30M; managed a portfolio without defaults\n•\tLed a team of 2 junior analysts; developed market risk alerts and designed stress testing scenarios that prevented the company from incurring losses in equities investments (loss rate less than 5%)\nInvestment Risk Assistant                                                                                         Oct 2010 – May 2012                                                           \n•\tAutomated and designed a new risk report for the trading desk linking it with platforms such as Bloomberg; the report resulted in a sounder investment monitoring process and reduced operational risk\nSKILLS AND INTERESTS\nSoftware: Bloomberg, Reuters, Risk Simulator, Microsoft Office, Excel, PowerPoint. \nLanguages: English, Spanish\nInterests: Traveling, jogging, reading, cooking\n \n","job_title":"Associate - Market Risk Regulatory Program Manager","job_post":"Position Description\nMorgan Stanley seeks an Associate level candidate to join the Firm Risk Management’s Market Risk Department (“MRD”) to provide coverage for a suite of regulatory deliverables with a focus on Fundamental Review of Trading Book (FRTB) Program.\n \nBased in Baltimore, this individual will report to FRTB Program manager in Enterprise Risk Management. The role involves working with a variety of business units and control groups across the organization on the execution of FRTB Program and providing both execution and analytical support.\n \nPrimary job responsibilities include:\n• Support FRTB program management in identifying and implementing solutions for various work streams within FRTB program, such as Internal model Approach, Standardized Approach, risk factor analysis, P&L attribution test, trading / banking book boundary\n \n• Help identifying dependencies and risks within FRTB framework and communicate them to Program teams\n \n• Support and enhance relationships with teams across Risk, Finance, Operations, and Technology to ensure delivery of cross-divisional projects\n \n• Monitor FRTB Program plan, ensuring it is up-to-date and work with internal partners to ensure timely progression and achievement of milestones\n \n• Produce documentation and presentations, including Steering Committee materials to effectively communicate key FRTB information to senior management and regulators\n \n• Participate in ISDA FRTB working groups and collect the Firm’s feedback for the industry communication with regulators\n \nQualifications\nSkills Required\n• 2-3 years of professional experience in financial services\n \n• Market risk management or Finance background, strong analytical skills\n \n• Experience working on cross-functional projects\n \n• Master’s degree in economics or finance (or an equivalent) and a solid academic background a plus; FRM certificate is a plus\n \n• Bachelor’s degree\n \n• Strong interpersonal and communication skills, written and verbal\n \n• Attention to detail and ability to prioritize projects and workload\n \n• Self-motivator and team player who brings a “can-do” approach\n \n• High degree of technical proficiency with Microsoft Office, knowledge in PowerPoint, Excel, SharePoint, Visio\n","response":"\n\nDear Hiring Manager,\n\nI am writing to express my enthusiasm for the Associate - Market Risk Regulatory Program Manager position at Morgan Stanley. With my extensive experience in leading financial risk teams, designing credit and market risk models, and aiding organizations in leveraging risk management tools, I am confident that I am the ideal candidate for this position.\n\nAs a Strategic and goal-driven professional, I am well-versed in risk assessment, detail-oriented, cross-functional projects, team-playing, financial services, interpersonal skills, and analytical skills. I have supported lecturers in the delivery of operational risk management classes, weekly discussions, and assignment grading as a Teaching Associate at Columbia University. Additionally, I have served as a Career Design Lab (CDL) Intern at Columbia University, coordinating events, gathering stakeholder requirements and strategizing initiatives.\n\nAt La Positiva Seguros, I was a Senior Risk Manager of Investments and Surety, adapting the investment risk management for the company and its subsidiaries to meet international standards, hiring two senior analysts to form a new department of credit risk of surety and reinsurance business, developing a risk management framework to evaluate the credit risk of new proposals of company contracts and monitoring the risk of the surety portfolio of $1B, and leading a team of 6 risk senior analysts. Moreover, as an Investment Risk Manager, I designed a robust investment risk model for portfolios over $1B, prevented downgrades and significant financial losses, and introduced new proposals to the company’s Risk Committee and at Board meetings.\n\nI am certain that I possess the necessary qualifications and technical skills to successfully fulfill the duties of the Associate - Market Risk Regulatory Program Manager role at Morgan Stanley. I am excited to learn more about the position and the company and look forward to discussing my qualifications in further detail. Thank you for your time and consideration.\n\nSincerely,\n[Your Name]"}
{"id":"3438daa5-4224-454f-b2ab-cfb993e91e8e","date":"2023-01-21T17:30:44.118Z","applicants_name":"Julio Manyari","email":"jmanyariv@gmail.com","professional_background":"Strategic and goal-driven professional with demonstrated experience in leading financial risk teams to develop sound risk frameworks. Skilled in designing credit and market risk models to quantify the expected loss of investments. Passionate about aiding organizations in leveraging risk management tools to achieve objectives.\n\nCore Competences: Strategic Thinking , Risk Assessment , Detail Oriented, Cross-functional projects, Team Player, Financial Services      , Interpersonal Skills, Analytical Skills\n  \nTeaching Associate, Columbia University – New York, USA                                      May 2021 – Aug 2021\n•\tSupporting lecturer in the delivery of operational risk management class, weekly discussions, and assignment grading.\nCareer Design Lab (CLD) Intern, Columbia University – New York, USA                   Oct 2020 – Apr 2021\n•\tServed as a CDL ambassador between students and industry to coordinate events, gather stakeholder requirements and strategize initiatives.\nLa Positiva Seguros - Lima, Peru                                                                               Oct 2010 – Dec 2019                                                           \nSenior Risk Manager of Investments and Surety                                                     May 2019 – Dec 2019                                                           \n•\tAdapted the investment risk management for the company and its subsidiaries to meet international standards of Fosun Group (China), the company’s new main shareholder; aided to comply with regulatory frameworks such as Solvency II and IFRS 9\n•\tHired two senior analysts to form a new department of credit risk of surety and reinsurance business\n•\tDeveloped a risk management framework to evaluate the credit risk of new proposals of company contracts and monitored the risk of the surety portfolio of $1B \n•\tLed a team of 6 risk senior analysts including overseeing their performance; promoted several times \nInvestment Risk Manager                                                                                         May 2014 – May 2019                                                           \n•\tDesigned a robust investment risk model for portfolios over $1B; prevented downgrades and significant financial losses. Maintained a default ratio of less than 0.5% of the portfolio\n•\tIntroduced new proposals to the company’s Risk Committee and at Board meetings, resulting in the implementation of new hedging strategies, which were aligned with the Board's risk appetite and allowed company to meet internal objectives and regulatory indicators\n•\tLed a team of 4 risk analysts and oversaw development of risk models for new types of investments; defined internal limits and established an early alerts system to prevent high concentration in investments\nInvestment Risk Analyst                                                                                           May 2012 – May 2014                                                           \n•\tPerformed counterparty risk analysis of fixed income and equities investments of up to $ 30M; managed a portfolio without defaults\n•\tLed a team of 2 junior analysts; developed market risk alerts and designed stress testing scenarios that prevented the company from incurring losses in equities investments (loss rate less than 5%)\nInvestment Risk Assistant                                                                                         Oct 2010 – May 2012                                                           \n•\tAutomated and designed a new risk report for the trading desk linking it with platforms such as Bloomberg; the report resulted in a sounder investment monitoring process and reduced operational risk\nSKILLS AND INTERESTS\nSoftware: Bloomberg, Reuters, Risk Simulator, Microsoft Office, Excel, PowerPoint. \nLanguages: English, Spanish\nInterests: Traveling, jogging, reading, cooking\n","job_title":"Associate - Market Risk Regulatory Program Manager","job_post":"Position Description\nMorgan Stanley seeks an Associate level candidate to join the Firm Risk Management’s Market Risk Department (“MRD”) to provide coverage for a suite of regulatory deliverables with a focus on Fundamental Review of Trading Book (FRTB) Program.\n \nBased in Baltimore, this individual will report to FRTB Program manager in Enterprise Risk Management. The role involves working with a variety of business units and control groups across the organization on the execution of FRTB Program and providing both execution and analytical support.\n \nPrimary job responsibilities include:\n• Support FRTB program management in identifying and implementing solutions for various work streams within FRTB program, such as Internal model Approach, Standardized Approach, risk factor analysis, P&L attribution test, trading / banking book boundary\n \n• Help identifying dependencies and risks within FRTB framework and communicate them to Program teams\n \n• Support and enhance relationships with teams across Risk, Finance, Operations, and Technology to ensure delivery of cross-divisional projects\n \n• Monitor FRTB Program plan, ensuring it is up-to-date and work with internal partners to ensure timely progression and achievement of milestones\n \n• Produce documentation and presentations, including Steering Committee materials to effectively communicate key FRTB information to senior management and regulators\n \n• Participate in ISDA FRTB working groups and collect the Firm’s feedback for the industry communication with regulators\n \nQualifications\nSkills Required\n• 2-3 years of professional experience in financial services\n \n• Market risk management or Finance background, strong analytical skills\n \n• Experience working on cross-functional projects\n \n• Master’s degree in economics or finance (or an equivalent) and a solid academic background a plus; FRM certificate is a plus\n \n• Bachelor’s degree\n \n• Strong interpersonal and communication skills, written and verbal\n \n• Attention to detail and ability to prioritize projects and workload\n \n• Self-motivator and team player who brings a “can-do” approach\n \n• High degree of technical proficiency with Microsoft Office, knowledge in PowerPoint, Excel, SharePoint, Visio\n","response":" \n\nDear Hiring Manager,\n\nI am writing to apply for the position of Associate - Market Risk Regulatory Program Manager at Morgan Stanley. With over nine years of experience in the financial services industry, I am confident that I possess the necessary skills and qualifications to make a meaningful contribution to your team.\n\nAs a strategic and goal-driven professional, I have a proven track record of leading financial risk teams to develop sound risk frameworks. I am especially skilled in designing credit and market risk models to quantify the expected loss of investments, as well as leveraging risk management tools to achieve objectives. I also have an excellent understanding of the FRTB (Fundamental Review of Trading Book) program and have supported the program management in identifying and implementing solutions for various work streams within the FRTB program.\n\nIn addition, I have experience working on cross-functional projects, possess strong interpersonal and communication skills, and am highly proficient with Microsoft Office and other software tools. My experience, combined with my detail-oriented nature, ability to prioritize and self-motivation, makes me an ideal candidate for this position.\n\nI am confident that my skills and experience make me an ideal fit for this position, and I look forward to discussing my qualifications further. Thank you for your time and consideration.\n\nSincerely,\n\n[Your Name]"}
{"id":"441aac21-04e0-488a-a53c-f76b9baae3e3","date":"2023-01-21T17:31:02.082Z","applicants_name":"Julio Manyari","email":"jmanyariv@gmail.com","professional_background":"Strategic and goal-driven professional with demonstrated experience in leading financial risk teams to develop sound risk frameworks. Skilled in designing credit and market risk models to quantify the expected loss of investments. Passionate about aiding organizations in leveraging risk management tools to achieve objectives.\n\nCore Competences: Strategic Thinking , Risk Assessment , Detail Oriented, Cross-functional projects, Team Player, Financial Services      , Interpersonal Skills, Analytical Skills\n  \nTeaching Associate, Columbia University – New York, USA                                      May 2021 – Aug 2021\n•\tSupporting lecturer in the delivery of operational risk management class, weekly discussions, and assignment grading.\nCareer Design Lab (CLD) Intern, Columbia University – New York, USA                   Oct 2020 – Apr 2021\n•\tServed as a CDL ambassador between students and industry to coordinate events, gather stakeholder requirements and strategize initiatives.\nLa Positiva Seguros - Lima, Peru                                                                               Oct 2010 – Dec 2019                                                           \nSenior Risk Manager of Investments and Surety                                                     May 2019 – Dec 2019                                                           \n•\tAdapted the investment risk management for the company and its subsidiaries to meet international standards of Fosun Group (China), the company’s new main shareholder; aided to comply with regulatory frameworks such as Solvency II and IFRS 9\n•\tHired two senior analysts to form a new department of credit risk of surety and reinsurance business\n•\tDeveloped a risk management framework to evaluate the credit risk of new proposals of company contracts and monitored the risk of the surety portfolio of $1B \n•\tLed a team of 6 risk senior analysts including overseeing their performance; promoted several times \nInvestment Risk Manager                                                                                         May 2014 – May 2019                                                           \n•\tDesigned a robust investment risk model for portfolios over $1B; prevented downgrades and significant financial losses. Maintained a default ratio of less than 0.5% of the portfolio\n•\tIntroduced new proposals to the company’s Risk Committee and at Board meetings, resulting in the implementation of new hedging strategies, which were aligned with the Board's risk appetite and allowed company to meet internal objectives and regulatory indicators\n•\tLed a team of 4 risk analysts and oversaw development of risk models for new types of investments; defined internal limits and established an early alerts system to prevent high concentration in investments\nInvestment Risk Analyst                                                                                           May 2012 – May 2014                                                           \n•\tPerformed counterparty risk analysis of fixed income and equities investments of up to $ 30M; managed a portfolio without defaults\n•\tLed a team of 2 junior analysts; developed market risk alerts and designed stress testing scenarios that prevented the company from incurring losses in equities investments (loss rate less than 5%)\nInvestment Risk Assistant                                                                                         Oct 2010 – May 2012                                                           \n•\tAutomated and designed a new risk report for the trading desk linking it with platforms such as Bloomberg; the report resulted in a sounder investment monitoring process and reduced operational risk\nSKILLS AND INTERESTS\nSoftware: Bloomberg, Reuters, Risk Simulator, Microsoft Office, Excel, PowerPoint. \nLanguages: English, Spanish\nInterests: Traveling, jogging, reading, cooking\n","job_title":"Associate - Market Risk Regulatory Program Manager","job_post":"Position Description\nMorgan Stanley seeks an Associate level candidate to join the Firm Risk Management’s Market Risk Department (“MRD”) to provide coverage for a suite of regulatory deliverables with a focus on Fundamental Review of Trading Book (FRTB) Program.\n \nBased in Baltimore, this individual will report to FRTB Program manager in Enterprise Risk Management. The role involves working with a variety of business units and control groups across the organization on the execution of FRTB Program and providing both execution and analytical support.\n \nPrimary job responsibilities include:\n• Support FRTB program management in identifying and implementing solutions for various work streams within FRTB program, such as Internal model Approach, Standardized Approach, risk factor analysis, P&L attribution test, trading / banking book boundary\n \n• Help identifying dependencies and risks within FRTB framework and communicate them to Program teams\n \n• Support and enhance relationships with teams across Risk, Finance, Operations, and Technology to ensure delivery of cross-divisional projects\n \n• Monitor FRTB Program plan, ensuring it is up-to-date and work with internal partners to ensure timely progression and achievement of milestones\n \n• Produce documentation and presentations, including Steering Committee materials to effectively communicate key FRTB information to senior management and regulators\n \n• Participate in ISDA FRTB working groups and collect the Firm’s feedback for the industry communication with regulators\n \nQualifications\nSkills Required\n• 2-3 years of professional experience in financial services\n \n• Market risk management or Finance background, strong analytical skills\n \n• Experience working on cross-functional projects\n \n• Master’s degree in economics or finance (or an equivalent) and a solid academic background a plus; FRM certificate is a plus\n \n• Bachelor’s degree\n \n• Strong interpersonal and communication skills, written and verbal\n \n• Attention to detail and ability to prioritize projects and workload\n \n• Self-motivator and team player who brings a “can-do” approach\n \n• High degree of technical proficiency with Microsoft Office, knowledge in PowerPoint, Excel, SharePoint, Visio\n","response":"\n\nDear Hiring Manager,\n\nI am writing to apply for the Associate - Market Risk Regulatory Program Manager position at Morgan Stanley. With my experience in leading financial risk teams, designing credit and market risk models, and leveraging risk management tools, I am confident that I am the right candidate for this role.\n\nI have a strategic and goal-driven approach to my work, and I am highly detail-oriented, analytical, and a team player. I have a track record of success in my professional background, including my role as Senior Risk Manager of Investments and Surety at La Positiva Seguros, where I adapted the investment risk management for the company and its subsidiaries to meet international standards of Fosun Group (China). Additionally, I have experience working on cross-functional projects, such as my role as a Career Design Lab (CLD) Intern at Columbia University, where I served as a CDL ambassador between students and industry to coordinate events and strategize initiatives.\n\nI have the technical proficiency and skills required for this role, including a Master’s degree in economics or finance (or an equivalent) and a solid academic background, strong analytical skills, experience working on cross-functional projects, and strong interpersonal and communication skills. I am also proficient with Microsoft Office, including PowerPoint, Excel, SharePoint, and Visio.\n\nI am excited to bring my experience and skills to Morgan Stanley and am confident that I can make an immediate contribution to the success of the team. I would welcome an opportunity to discuss my candidacy further and am available for an interview at your earliest convenience.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]"}
{"id":"b9623aa8-164d-4407-9775-3064543be9fa","date":"2023-01-21T18:10:26.496Z","applicants_name":"jalen","email":"career@irakli.xyz","professional_background":"I have been educated in how to raise cows since my birth. The man who taught me was also very very cow-ish. The man was actually a cow. It allows me to relate many farm aniamls in my current situation. I have had so many fantasies about cow women that it actually pretty unhealthy. I cant actually explain why this bricks me up so bad but its kinda cool. I am the CEO of swag btw. ","job_title":"COW of Swag","job_post":"Milk at least 50000000000000000000000000000000000000000000000000000000000000000000000 cow men daily. ","response":"\n\nDear Hiring Manager,\n\nI am writing to apply for the position of COW of Swag. With my extensive background in raising cows, I believe I am uniquely qualified for this role.\n\nI was born into a family of cow raisers, and I was taught the fundamentals of raising cows by a very wise and experienced cow. This gave me a deep understanding of cows and their behavior, which I believe will be invaluable in the position of COW of Swag. Additionally, my experience with cow women has given me a unique perspective on the nuances of cow behavior and how to handle them.\n\nI am confident in my ability to meet the requirements of the position and exceed expectations. I am able to milk at least 50000000000000000000000000000000000000000000000000000000000000000000000 cow men daily. I am also comfortable with the use of technology to manage and monitor the cows, as well as providing general maintenance and upkeep.\n\nI am excited at the prospect of joining the team at Swag and believe that my skills and experience make me an ideal candidate for the position. I look forward to hearing from you and discussing the possibility of me joining the team.\n\nSincerely,\n\n[Your Name]"}
{"id":"0b1ecfd4-93af-4097-8f8d-f5494b4914fc","date":"2023-01-25T01:28:57.232Z","applicants_name":"Irakli","email":"career@irakli.xyz","professional_background":"I have a Bachelors degree in Business Economics and Data Analytics. While studying I was also the President of Beloit Investment Club and a Teaching Assistant for Business Management Economics. I was praised as a great leader by my professor of Art of Leading class.\nRight now I am working as a Financial Analyst at Hendricks Commercial Properties Acquisitions & Dispositions department. At this job I create reports and analyze portfolio real estate holdings, acquisitions, and dispositions.\nI am also a Founder of Financial Curator, a personal finance company that provides distilled information and educational articles that help users make informed financial decisions. At this job I designed and built a website with ease of use and functionality in mind. I also developed a business strategy for trust and brand awareness growth within the industry.\nPreviously I have worked as a Quantitative Strategist at CUNA Mutual Group. My accomplishments there were: a “Global Energy Market Outlook” research project; and the automation of quarterly portfolio performance analysis reporting.\nEven before that I was the Web Developer & Data Analyst at CoinGrades, where I designed and built a website using HTML, CSS, and JavaScript. I created a Search Engine Optimization strategy.\nI also performed a cohort data analysis on user behavioral reports to gather business insights and adjust the website for longer session lengths.\nAnd lastly, I was a Founder & Operations Manager at Doosy, where I developed a business plan, registered an entity, and sourced the product manufacturers from abroad. I also led a team of three to keep the business highly efficient and profitable, with a profit margin of 30%. I also created online presence and marketed the product with cost-effective ads, reached with A/B testing.\n","job_title":"Product Development Manager","job_post":"The Product Development Manager oversees staff that manages Lester’s proprietary design estimating software (Improv) and is responsible for the overall execution of innovative initiatives and implementation of product development. The individual will utilize a holistic view by seeking out concerns of internal and external stakeholders regarding costs, aesthetics, manufacturing, construction, and ease of transport to ensure appropriate objectives and priorities are enabled within the organization. The successful candidate will be capable of identifying concerns, as well as solutions.\n\nSenior staff position working collaboratively with Lester’s President as a strategic member of the management team to lead Improv and product development, the implementation and application processes for the organization’s overall success.\nWork with VP of Engineering Services to develop product engineering documents (PED) as the basis for standardized design.\nWork with Lester PEs to ensure standard design practices remain code compliant.\nStay informed of building code changes.\nVigilantly review reported incidents of issues with or failures of Lester products seeking to identify patterns early and make needed adjustments to design methods or products.\nDesign and execute tests, build prototypes, and utilize 3-D structural modeling as needed to answer questions critical to development of new products or procedures.\nCollaborate with Lester teams to develop algorithms, product, and business rules producing positive results in moving projects through Order Entry and Order Management.\nCultivate relationships with other businesses supporting Lester needs.\nWork closely with Engineering, Manufacturing, Construction, Sales and Marketing to ensure we have the breadth of product and support needed to grow market share.\nAchieve proficiency in the use of Lester’s proprietary estimating/sales software application (Improv) and other applications.\nPreparation, monitoring and management of the department’s annual operating plan.\nQualifications:\n\nPosition is office based at the Lester Prairie, MN facility.\nBachelor’s degree in Civil/Structural Engineering or related field preferred.\nProfessional Engineering License is preferred.\nProficiency in AutoCAD and overall computer skills.\n10+ years of experience in wood frame metal building industry is ideal.\nExperience in the engineering of buildings, building materials, construction business development or similar experience is preferred.\nStrong background in the markets Lester Buildings serves; agricultural, livestock, equestrian, commercial, suburban and residential is a plus.\nExcellent problem-solving skills and sound judgment in decision making.\nAbility to multi-task and work collaboratively as well as independently in a fast-paced environment.\nThe ability to effectively communicate with a wide variety of internal/external individuals and teams.\nMust be a detail-oriented, self-starter with strong organization skills.\nAbility to work with integrity, professionalism, and confidentiality.\nJob Type: Full-time\n\nBenefits:\n\n401(k)\nDental insurance\nEmployee assistance program\nHealth insurance\nHealth savings account\nLife insurance\nPaid time off\nVision insurance\nSchedule:\n\nMonday to Friday\nAbility to commute/relocate:\n\nLester Prairie, MN 55354: Reliably commute or planning to relocate before starting work (Preferred)\nEducation:\n\nBachelor's (Preferred)\nExperience:\n\nAutoCAD: 10 years (Preferred)\nStructural Engineering: 10 years (Preferred)","response":"\n\nDear Hiring Manager,\n\nI am writing to apply for the Product Development Manager position at Lester Buildings. With my background in Business Economics, Data Analytics, and experience in the wood frame metal building industry, I am confident that I am the perfect candidate for the job.\n\nI am currently a Financial Analyst at Hendricks Commercial Properties Acquisitions & Dispositions department, where I create reports and analyze portfolio real estate holdings, acquisitions, and dispositions. I am also a Founder of Financial Curator, a personal finance company that provides distilled information and educational articles that help users make informed financial decisions. As a Quantitative Strategist at CUNA Mutual Group, I created a “Global Energy Market Outlook” research project and automated quarterly portfolio performance analysis reporting. As a Web Developer and Data Analyst at CoinGrades, I designed and built a website using HTML, CSS, and JavaScript, and created a Search Engine Optimization strategy. And as a Founder and Operations Manager at Doosy, I developed a business plan, registered an entity, and sourced product manufacturers from abroad. I also led a team of three to keep the business highly efficient and profitable, with a profit margin of 30%.\n\nI have a Bachelor's degree in Business Economics and Data Analytics, and I have been praised as a great leader by my professor in the Art of Leading class. My experience and qualifications make me an ideal candidate for the Product Development Manager position. I am confident that I have the technical skills and experience to be successful in this role. I am also very organized, detail-oriented, and have excellent problem-solving skills.\n\nI am excited about the opportunity to join Lester Buildings and be part of a team that is committed to innovation and excellence. I look forward to hearing from you and discussing my qualifications further.\n\nThank you for your time and consideration.\n\nSincerely,\n[Your Name]"}
{"id":"2e62d084-e745-400b-9819-692ff79c0566","date":"2023-01-28T23:54:56.534Z","applicants_name":"Irakli","email":"career@irakli.xyz","professional_background":"I have a Bachelors degree in Business Economics and Data Analytics. While studying I was also the President of Beloit Investment Club and a Teaching Assistant for Business Management Economics. I was praised as a great leader by my professor of Art of Leading class.\nRight now I am working as a Financial Analyst at Hendricks Commercial Properties Acquisitions & Dispositions department. At this job I create reports and analyze portfolio real estate holdings, acquisitions, and dispositions.\nI am also a Founder of Financial Curator, a personal finance company that provides distilled information and educational articles that help users make informed financial decisions. At this job I designed and built a website with ease of use and functionality in mind. I also developed a business strategy for trust and brand awareness growth within the industry.\nPreviously I have worked as a Quantitative Strategist at CUNA Mutual Group. My accomplishments there were: a “Global Energy Market Outlook” research project; and the automation of quarterly portfolio performance analysis reporting.\nEven before that I was the Web Developer & Data Analyst at CoinGrades, where I designed and built a website using HTML, CSS, and JavaScript. I created a Search Engine Optimization strategy.\nI also performed a cohort data analysis on user behavioral reports to gather business insights and adjust the website for longer session lengths.\nAnd lastly, I was a Founder & Operations Manager at Doosy, where I developed a business plan, registered an entity, and sourced the product manufacturers from abroad. I also led a team of three to keep the business highly efficient and profitable, with a profit margin of 30%. I also created online presence and marketed the product with cost-effective ads, reached with A/B testing.\n","job_title":"Business Intelligence Analyst","job_post":"At Voro, we ask tough questions that data can answer, validate that data, and present meaningful insights that drive positive human experiences. Our people are what set us apart. We’re a team of strategic thinkers with technical expertise who solve complex business challenges. Our clients rely on us to provide insightful solutions and develop digital strategies that drive real growth. Our approach is centered around our belief that every challenge should be addressed with the user in mind. \n\nTHE ROLE\nYou love managing data from different sources and using it for analytics, visualization, and modeling techniques to deliver insights to our team and our clients. You naturally combine your hard skills using business intelligence software and tools with your soft skills communicating with the team, problem-solving, and analytical thinking.  You’ll help identify trends so that leaders can focus on what is important to drive profitability.\n\nYou will be in good company. You will work alongside industry experts with multiple teammates contributing to your individual growth. We invest heavily in your development and provide you with actionable and consistent feedback to support you along the way. You will actively participate with teams and clients. You will communicate your findings and have an opinion. You will ask questions and anticipate the next one. You will develop a meaningful toolkit of skills around collaboration, communication, storytelling, and, most importantly, client service.\nWHAT YOU'LL DO\nDevelop familiarity with data sources and comfort with the business intelligence toolkit to identify and understand anomalies in data sets quickly.\nTechnical proficiency with important department tools: Power BI, Google Data Studio, Microsoft Excel.\nDemonstrate awareness and understanding of vital agency tools and platforms, including Google Ads, Microsoft Advertising, Google Analytics, Facebook, Instagram, LinkedIn, Twitter, SEMrush, and STAT.\nSupport data quality, control, and scalability efforts through knowledge and proficiency of internal tools and client solutions.\nMonitor and identify agency-level trends through the use and continued development of business intelligence dashboards, reports, and custom solutions.\nUnderstand and help implement the process for the collection and analysis of data.\nAssist in maintaining department processes, data structures, and models.\nInteract with clients to assess requirements and troubleshoot frequently asked business intelligence questions.\nIdentify trends to empower clients’ business decisions and increase competitive advantage.\nCollaborate across departments; paid media, SEO, analytics, and business intelligence to help enact the best solution for our clients.\nShowcase your curiosity by immersing yourself in the world of digital marketing, always learning and rising to new challenges. \nGrow your client service skills by ensuring deliverables meet timelines and standards, surfacing observations from the data on calls and through email, and supporting the team’s organization with excellent note-taking and task prioritization habits.\nAdept in both the Google and Microsoft business suites, especially Excel, PowerPoint, and Gmail. Fluent with supporting SaaS tools, including Slack and Trello.\nYOUR QUALIFICATIONS\nIf reading about Voro and this job excited you, apply!","response":"\n\nTo the Voro Team,\n\nI am applying for the position of Business Intelligence Analyst, and I am confident that I am the perfect fit for this role.\n\nWith my Bachelor’s degree in Business Economics and Data Analytics, I have experience in creating reports and analyzing portfolio real estate holdings, acquisitions, and dispositions as a Financial Analyst at Hendricks Commercial Properties. I am also the Founder of Financial Curator, a personal finance company, and have designed and built a website with ease of use and functionality in mind. I have also developed a business strategy for trust and brand awareness growth within the industry.\n\nPreviously I have also worked as a Quantitative Strategist at CUNA Mutual Group, where I completed a “Global Energy Market Outlook” research project and automated quarterly portfolio performance analysis reporting. I was also the Web Developer & Data Analyst at CoinGrades, where I designed and built a website using HTML, CSS, and JavaScript, and created a Search Engine Optimization strategy. I also performed a cohort data analysis on user behavioral reports to gather business insights and adjust the website for longer session lengths. I was also the Founder & Operations Manager at Doosy, where I developed a business plan, registered an entity, and sourced the product manufacturers from abroad. I led a team of three to keep the business highly efficient and profitable, with a profit margin of 30%. I also created online presence and marketed the product with cost-effective ads, reached with A/B testing.\n\nI am confident that my technical expertise and soft skills, such as problem-solving, analytical thinking, communication, storytelling, and client service, are the perfect fit for the Business Intelligence Analyst role at Voro. I am passionate about digital marketing, learning, and rising to new challenges. I understand the importance of data collection, analysis, and quality control, and I am proficient in important department tools such as Power BI, Google Data Studio, and Microsoft Excel.\n\nI am excited to join a team of strategic thinkers that solve complex business challenges and provide meaningful insights. I look forward to the opportunity to contribute to Voro’s success.\n\nThank you for your consideration.\n\nSincerely,\n[Your Name]"}
{"id":"ccee8b23-8b8e-4205-b71a-4f45e72a0247","date":"2023-01-28T23:58:33.261Z","applicants_name":"Irakli","email":"career@irakli.xyz","professional_background":"I have a Bachelors degree in Business Economics and Data Analytics. While studying I was also the President of Beloit Investment Club and a Teaching Assistant for Business Management Economics. I was praised as a great leader by my professor of Art of Leading class.\nRight now I am working as a Financial Analyst at Hendricks Commercial Properties Acquisitions & Dispositions department. At this job I create reports and analyze portfolio real estate holdings, acquisitions, and dispositions.\nI am also a Founder of Financial Curator, a personal finance company that provides distilled information and educational articles that help users make informed financial decisions. At this job I designed and built a website with ease of use and functionality in mind. I also developed a business strategy for trust and brand awareness growth within the industry.\nPreviously I have worked as a Quantitative Strategist at CUNA Mutual Group. My accomplishments there were: a “Global Energy Market Outlook” research project; and the automation of quarterly portfolio performance analysis reporting.\nEven before that I was the Web Developer & Data Analyst at CoinGrades, where I designed and built a website using HTML, CSS, and JavaScript. I created a Search Engine Optimization strategy.\nI also performed a cohort data analysis on user behavioral reports to gather business insights and adjust the website for longer session lengths.\nAnd lastly, I was a Founder & Operations Manager at Doosy, where I developed a business plan, registered an entity, and sourced the product manufacturers from abroad. I also led a team of three to keep the business highly efficient and profitable, with a profit margin of 30%. I also created online presence and marketed the product with cost-effective ads, reached with A/B testing.\n","job_title":"Business Intelligence Analyst","job_post":"At Voro, we ask tough questions that data can answer, validate that data, and present meaningful insights that drive positive human experiences. Our people are what set us apart. We’re a team of strategic thinkers with technical expertise who solve complex business challenges. Our clients rely on us to provide insightful solutions and develop digital strategies that drive real growth. Our approach is centered around our belief that every challenge should be addressed with the user in mind. \n\nTHE ROLE\nYou love managing data from different sources and using it for analytics, visualization, and modeling techniques to deliver insights to our team and our clients. You naturally combine your hard skills using business intelligence software and tools with your soft skills communicating with the team, problem-solving, and analytical thinking.  You’ll help identify trends so that leaders can focus on what is important to drive profitability.\n\nYou will be in good company. You will work alongside industry experts with multiple teammates contributing to your individual growth. We invest heavily in your development and provide you with actionable and consistent feedback to support you along the way. You will actively participate with teams and clients. You will communicate your findings and have an opinion. You will ask questions and anticipate the next one. You will develop a meaningful toolkit of skills around collaboration, communication, storytelling, and, most importantly, client service.\nWHAT YOU'LL DO\nDevelop familiarity with data sources and comfort with the business intelligence toolkit to identify and understand anomalies in data sets quickly.\nTechnical proficiency with important department tools: Power BI, Google Data Studio, Microsoft Excel.\nDemonstrate awareness and understanding of vital agency tools and platforms, including Google Ads, Microsoft Advertising, Google Analytics, Facebook, Instagram, LinkedIn, Twitter, SEMrush, and STAT.\nSupport data quality, control, and scalability efforts through knowledge and proficiency of internal tools and client solutions.\nMonitor and identify agency-level trends through the use and continued development of business intelligence dashboards, reports, and custom solutions.\nUnderstand and help implement the process for the collection and analysis of data.\nAssist in maintaining department processes, data structures, and models.\nInteract with clients to assess requirements and troubleshoot frequently asked business intelligence questions.\nIdentify trends to empower clients’ business decisions and increase competitive advantage.\nCollaborate across departments; paid media, SEO, analytics, and business intelligence to help enact the best solution for our clients.\nShowcase your curiosity by immersing yourself in the world of digital marketing, always learning and rising to new challenges. \nGrow your client service skills by ensuring deliverables meet timelines and standards, surfacing observations from the data on calls and through email, and supporting the team’s organization with excellent note-taking and task prioritization habits.\nAdept in both the Google and Microsoft business suites, especially Excel, PowerPoint, and Gmail. Fluent with supporting SaaS tools, including Slack and Trello.\nYOUR QUALIFICATIONS\nIf reading about Voro and this job excited you, apply!","response":"\n\nDear Hiring Manager,\n\nI am writing to apply for the position of Business Intelligence Analyst at Voro. With my Bachelors degree in Business Economics and Data Analytics, and my experience as a Financial Analyst, Quantitative Strategist, Web Developer & Data Analyst, and Founder & Operations Manager, I believe I have the right combination of skills and experience to be a great fit for this role.\n\nI have been praised for my leadership skills and have used them to create reports and analyze portfolio real estate holdings, acquisitions, and dispositions at my current job as a Financial Analyst. I have also developed a business strategy for trust and brand awareness growth within the industry as a Founder of Financial Curator. \n\nAt CoinGrades, I designed and built a website using HTML, CSS, and JavaScript, and created a Search Engine Optimization strategy. I also performed a cohort data analysis on user behavioral reports to gather business insights and adjust the website for longer session lengths. At CUNA Mutual Group, I created a “Global Energy Market Outlook” research project and automated quarterly portfolio performance analysis reporting. As the Founder & Operations Manager at Doosy, I developed a business plan, registered an entity, sourced product manufacturers from abroad, and created an online presence and marketed the product with cost-effective ads, reached with A/B testing.\n\nI am confident I can use my technical expertise and problem-solving skills to help identify trends, develop familiarity with data sources, manage data from different sources, and use data for analytics, visualization, and modeling techniques to deliver insights to the team and clients. I am also comfortable with important department tools like Power BI, Google Data Studio, Microsoft Excel, and other agency tools and platforms including Google Ads, Microsoft Advertising, Google Analytics, Facebook, Instagram, LinkedIn, Twitter, SEMrush, and STAT.\n\nI am eager to apply my knowledge and experience to the position of Business Intelligence Analyst at Voro. I am confident I can help you develop meaningful solutions that drive positive human experiences and real growth. Thank you for your time and consideration.\n\nSincerely,\n\n[Your Name]"}